Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་གང་ཁྱོད་ཀྱིས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་དཔག་ཏུ་མེད་པ་དག་ལ་ཟླ་བ་གསུམ་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ཤིང་། རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་པ་དག་དང་། གྲོང་ཁྱེར་བརྒྱད་ཁྲི་བཞི་སྟོང་དག་ཀྱང་ཕུལ་བ་དེ་ལ་རྗེས་སུ་ཡི་རང་བར་གྱིས་ལ།
en: Then the brahmin Samudrareṇu said to King Araṇemin, ‘Great king, rejoice that you have served the Bhagavat and his innumerable saṅgha of bhikṣus with every service for three months, and presented them with a variety of valuables and 84,000 cities.

source: རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་དང་ཡོངས་སུ་གཏོང་བ་དང་ལྡན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ཤིག །
en: You should dedicate to the highest, most complete enlightenment that entire aggregation of merit accompanied by rejoicing and the aggregation of merit accompanied by relinquishment.’ “

source: དེ་བཞིན་དུ་རྒྱལ་བུ་སྟོང་པོ་དེ་དག་དང་། དེ་བཞིན་དུ་ཁམས་ཀྱི་རྒྱལ་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། གཞན་ཡང་སྲོག་ཆགས་དུང་ཕྱུར་ཕྲག་དགུ་དང་། བྱེ་བ་ཕྲག་གཉིས་པོ་རྣམས་ཀྱང་ཡང་དག་པར་འཛིན་དུ་བཅུག་ནས་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེས་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་ནས་འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ།
en: The brahmin Samudrareṇu made the thousand princes aspire in that way, and the 84,000 minor kings and the 920,000,000 other beings also aspired to and became dedicated to attaining the highest, most complete enlightenment through their accumulation of merit accompanied by rejoicing.

source: །ཁྱེད་ཀྱིས་ཡོན་ཏན་འདི་ལ་རྗེས་སུ་ཡི་རང་བར་བྱས་ཏེ་ཕུལ་ལ་འདི་སྐད་ཅེས་ཀྱང་སྨྲོས་ཤིག །སྦྱིན་པ་འདིས་བདག་དབང་པོའི་གནས་མིན་ཚངས་པའི་འཇིག་རྟེན་འབྲས་བུ་མི་འདོད་ན། །རླུང་གི་ཤུགས་ལྟར་མགྱོགས་ཤིང་གཡོ་བ་རྒྱལ་པོའི་སྲིད་ཀྱི་དཔལ་ལྟ་སྨོས་ཅི་དགོས།
en: The Bhagavat said, ‘You should rejoice in having made this gift, and you should recite the following: “ ‘I do not wish for Indra’s realm or Brahmā’s world as a result of this generosity, And certainly not for the splendor of a kingdom, which is as fleeting and inconstant as the wind.

source: །བདག་གི་གུས་པ་ཆེན་པོའི་སྦྱིན་པ་འདི་ཡི་འབྲས་བུ་གང་ཡིན་དེ་ཡིས་ནི། །སེམས་ལ་དབང་བྱེད་མཚུངས་མེད་བྱང་ཆུབ་འཐོབ་ཅིང་སེམས་ཅན་རྣམས་ཀྱང་སྒྲོལ་གྱུར་ཅིག །
en: But by the fruit of this act of generosity of mine, which was made with great devotion, May I attain unequaled enlightenment, which brings sovereignty over the mind, for the liberation of beings.’ ”

source: སྙིང་རྗེ་པད་མ་དཀར་པོ་ལས་སྦྱིན་པ་གཏོང་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་གསུམ་པའོ།། །།
en: That concludes “Generosity,” which is the third chapter of The White Lotus of Compassion.

source: རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་འདི་སྙམ་དུ་དགོངས་ཏེ། བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་འདིས་སྲོག་ཆགས་བྱེ་བ་ཕྲག་མང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་ནས་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་བཀོད་པ་དེ་དག་ངས་ལུང་བསྟན་པར་བྱ་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཀྱང་བསྟན་པར་བྱའོ་སྙམ་མོ།
en: The Prophecies to the Bodhisattvas Chapter 4 “Then, noble son, the tathāgata arhat samyaksam­buddha Ratnagarbha thought, ‘The brahmin Samudrareṇu has made many millions of beings aspire to, be fixed upon, and be dedicated to the highest, most complete enlightenment and has brought them to an irreversible level. I shall give them prophecies, telling them what their buddha realms will be.’ “

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་ནས་འཛུམ་པ་མཛད་དོ།
en: Then the Bhagavat entered the samādhi called never forgetting bodhicitta, and he smiled.

source: །འཛུམ་པ་མཛད་པ་དེས་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་མུ་མེད་པ་དག་སྣང་བ་རྒྱ་ཆེན་པོས་སྣང་བར་མཛད་ནས།
en: That smile illuminated countless buddha realms with a vast radiance.

source: རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་དང་གཞན་ཡང་སྲོག་ཆགས་བྱེ་བ་ཕྲག་མང་པོ་དག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་རྣམས་ཀྱང་བསྟན་ཏོ།
en: He showed the array of qualities of those buddha realms to King Araṇemin and the many millions of beings.

source: །དེའི་ཚེ་ན་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་གི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་སྣང་བ་དེ་མཐོང་ནས་སངས་རྒྱས་ཀྱི་མཐུས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ལྷགས་ནས།
en: At that time, the bodhisattva mahāsattvas in countless buddha realms in the ten directions saw that radiance, and through the power of the Buddha, they came to this world in order to see, pay homage to, and honor the Bhagavat and his saṅgha of bhikṣus. “

source: དེ་དག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཅིང་བསྙེན་བཀུར་བྱས་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ལུང་བསྟན་པ་ཐོས་པར་འདོད་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ།
en: They made offerings to the Bhagavat with their various bodhisattva emanations, and they bowed their heads to the Bhagavat’s feet, honored him, and seated themselves before him because they wished to listen to the prayers and prophecies of the bodhisattvas. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཇེ་དང་པོར་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཟུང་ཤིག །
en: Then, noble son, the brahmin Samudrareṇu, the chief court priest, said to King Araṇemin, ‘Great king, you should first choose your buddha realm’s array of qualities.’ “

source: དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ནི་བྱང་ཆུབ་དོན་དུ་གཉེར་བ་ལགས་ཏེ།
en: Then King Araṇemin placed his palms together, bowed toward the Bhagavat, and said, ‘Bhagavat, I have enlightenment as my goal.

source: འདི་ལྟར་བདག་གིས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་དཔག་ཏུ་མ་མཆིས་པ་དག་ལ་དགུང་ཟླ་གསུམ་དུ་ཡོ་བྱད་རྣམ་པ་སྣ་ཚོགས་དག་གིས་བསྙེན་བཀུར་བགྱིས་ནས།
en: I have honored the Bhagavat and his saṅgha of countless bhikṣus for three months with various offerings.

source: དགེ་བའི་རྩ་བ་དེ་ཡང་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ཤིང་།
en: I have dedicated the good roots from this toward the attainment of the highest, most complete enlightenment.

source: བཅོམ་ལྡན་འདས་བདག་གིས་དགུང་ལོ་བདུན་པོ་འདི་དག་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་བསམས་ལགས་ན།
en: Bhagavat, for these seven years I have contemplated the arrays of qualities in buddha realms.

source: བཅོམ་ལྡན་འདས་བདག་སངས་རྒྱས་ཀྱི་ཞིང་གང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེར་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དག་འབྱུང་བར་མ་གྱུར་ཅིག །
en: Bhagavat, in the buddha realm where I will attain the complete enlightenment of perfect buddhahood, may there be no hells, animals, or Yama’s realm.

source: སེམས་ཅན་གང་དག་དེ་ནས་འཆི་འཕོ་བར་འགྱུར་བ་དེ་དག་ངན་འགྲོ་རྣམས་སུ་སྐྱེ་བར་མ་གྱུར་ཅིག །
en: May the beings who die there not take rebirth in the lower existences.

source: དེ་ན་སེམས་ཅན་ཐམས་ཅད་གསེར་གྱི་མདོག་ལྟ་བུར་གྱུར་ཅིག །
en: May all the beings there have a golden color.

source: དེ་ན་ལྷ་དང་མི་ཐམས་ཅད་ཀྱང་ཁྱད་པར་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there be no difference between the devas and humans there.

source: དེ་ན་སེམས་ཅན་ཐམས་ཅད་ཚེ་རབས་དྲན་པར་གྱུར་ཅིག །
en: May all the beings there remember their past lives.

source: སེམས་ཅན་ཐམས་ཅད་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ན་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་རྣམས་མཐོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ལྷའི་མིག་དང་ལྡན་པར་གྱུར་ཅིག །
en: May all those beings have the kind of divine sight by which they can see the hundreds of thousands of millions of trillions of buddhas who remain, stay, live, and teach the Dharma in other realms.

source: སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་དག་གིས་ཆོས་སྟོན་པ་ཐོས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ལྷའི་རྣ་བ་དང་ལྡན་པར་གྱུར་ཅིག །
en: May all those beings have the kind of divine hearing by which they can hear the hundreds of thousands of millions of trillions of buddhas teaching the Dharma.

source: སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་ན་གནས་པའི་སེམས་ཅན་དེ་དག་གི་སེམས་ཀྱི་སྤྱོད་པ་ཀུན་ཤེས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་ལ་མཁས་པ་དང་ལྡན་པར་གྱུར་ཅིག །
en: May all those beings there have knowledge of the minds of others, by which they can know the mental activities of beings dwelling in many hundreds of thousands of millions of trillions of buddha realms.

source: སེམས་ཅན་ཐམས་ཅད་སེམས་བསྐྱེད་པ་གཅིག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་དག་ཏུ་མཆི་བར་འགྱུར་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་བྱ་བ་ལ་མཁས་པ་དང་ལྡན་པར་གྱུར་ཅིག །
en: May all those beings have skill in accomplishing miracles by which they can, with one aspiration, be in hundreds of thousands of millions of trillions of buddha realms.

source: དེ་ན་སེམས་ཅན་རྣམས་ཡོངས་སུ་འཛིན་པ་དང་ལྡན་པ་མ་མཆིས་ཤིང་ཐ་ན་རང་གི་ལུས་ལ་ཡིད་ཀྱི་འཛིན་པ་ཡང་མ་མཆིས་པར་གྱུར་ཅིག །
en: May the beings who are in that realm have no attachment, not even attachment to their own bodies.

source: སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་སླར་མི་ལྡོག་པར་གྱུར་ཅིག །
en: May all those beings be on the level of irreversible progress toward the highest, most complete enlightenment.

source: སེམས་ཅན་ཐམས་ཅད་རྫུས་ཏེ་སྐྱེ་བར་གྱུར་ཅིག །
en: May the beings there be born spontaneously.

source: དེ་ན་བུད་མེད་དུ་གདགས་པ་ཡང་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there not be the designation of female there.

source: དེ་ན་སེམས་ཅན་རྣམས་སྨོན་ལམ་གྱི་དབང་མ་གཏོགས་པར་ཚེའི་ཚད་ཀྱི་མཐའ་མ་མཆིས་པར་གྱུར་ཅིག །
en: May the lifespan of the beings there have no end except through the power of their prayers.

source: དེ་ན་སེམས་ཅན་རྣམས་ལ་མི་དགེ་བའི་མིང་ཡང་འབྱུང་བར་མ་གྱུར་ཅིག །
en: May those beings not even know the word nonvirtuous.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་དྲི་ང་བ་འབྱུང་བར་མ་གྱུར་ཅིག །
en: May there be no bad smell in that buddha realm.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ལྷའི་ལས་ཤིན་ཏུ་འདས་པའི་སྤོས་ཀྱིས་ཁྱབ་པར་གྱུར་ཅིག །
en: May that buddha realm be permeated by the aroma of the Bhagavat that surpasses that of the devas.

source: སེམས་ཅན་ཐམས་ཅད་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་པར་གྱུར་ཅིག །
en: May all the beings there be adorned by the thirty-two signs of a great being.

source: སེམས་ཅན་ཐམས་ཅད་སྨོན་ལམ་མ་གཏོགས་པར་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་གྱུར་ཅིག །
en: May all those beings be in their last lifetime unless they pray otherwise.

source: དེ་ན་སངས་རྒྱས་ཀྱི་མཐུས་སེམས་ཅན་ཐམས་ཅད་སྔ་དྲོ་གཅིག་གིས་སངས་རྒྱས་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་སྙེད་དག་ལ་བསྙེན་བཀུར་བགྱིད་པར་འགྱུར་ཞིང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཀྱི་བར་དག་གིས་སངས་རྒྱས་རྣམས་ལ་མཆོད་པ་བགྱིད་པར་འཚལ་ན་ཡང་དེ་དག་ལ་དེ་བཞིན་དུ་འགྲུབ་པར་འགྱུར་ལ་དེ་ཉིད་ཀྱི་སྔ་དྲོས་སླར་ལྡོག་པར་གྱུར་ཅིག །
en: May all the beings there, through the power of the Buddha, be able in one morning to pay honor to an incalculable number of buddhas, accomplish their wish to make offerings to those buddhas through a variety of bodhisattva manifestations, and then return to my realm in that same morning.

source: སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་སྡེ་སྣོད་སྨྲ་བར་གྱུར་ཅིག། །།བམ་པོ་ལྔ་པ།
en: May all those beings converse about the Buddha’s piṭaka.

source: སེམས་ཅན་ཐམས་ཅད་སྲེད་མེད་ཀྱི་བུའི་སྟོབས་དང་ལྡན་པར་གྱུར་ཅིག །
en: May those beings have the power of Nārāyaṇa.

source: སེམས་ཅན་གང་གིས་ཀྱང་ཆེར་ན་ལྷའི་མིག་གིས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་གྱིས་བསྔགས་པའི་མཐའ་ཚད་འཛིན་པའི་རྔོ་མི་ཐོགས་པར་གྱུར་ཅིག །
en: May no being, even one with divine sight, be able to ascertain the extent of the qualities that adorn that buddha realm.

source: དེ་ན་སེམས་ཅན་ཐམས་ཅད་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྤོབས་པ་གྲངས་མ་མཆིས་པ་དག་ཐོབ་པར་གྱུར་ཅིག །
en: May all the beings there possess knowledge and confidence.

source: བྱང་ཆུབ་སེམས་དཔའ་རེ་རེའི་ལུས་ཀྱང་དཔག་ཚད་སྟོང་གི་ཚད་ཙམ་དུ་གྱུར་ཅིག །
en: May the body of each bodhisattva be a thousand yojanas tall.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེའི་འོད་གསལ་བར་གྱུར་ཅིག །
en: May that buddha realm be radiant.

source: དེའི་ཁོར་ཡུག་ན་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་བགྲང་བ་ལས་འདས་པ་དག་གདའ་བར་གྱུར་ཅིག །
en: May its environs have an array of qualities beyond enumeration.

source: སེམས་ཅན་གང་དག་དེར་སྐྱེ་བར་འགྱུར་བ་རྣམས་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་ཚངས་པར་སྤྱོད་པར་གྱུར་ཅིག །
en: May any being who is born there be celibate until enlightenment.

source: སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཕྱག་བགྱི་བའི་འོས་སུ་གྱུར་ཅིག །
en: May all beings there be worthy of homage from the world and its devas.

source: དབང་པོ་མ་ཚང་བར་མ་གྱུར་ཅིག །
en: May there be no deficiency in their faculties.

source: དེར་སེམས་ཅན་རྣམས་སྐྱེས་མ་ཐག་ཏུ་ལྷའི་ལས་ཤིན་ཏུ་འདས་པ་འཕགས་པའི་དགའ་བ་དང་བདེ་བ་ཐོབ་པར་གྱུར་ཅིག །
en: May the beings there, as soon as they are born, attain noble joy and happiness that transcends that of the devas.

source: དེ་ན་སེམས་ཅན་ཐམས་ཅད་དགེ་བའི་རྩ་བ་དང་འགྲོགས་པར་གྱུར་ཅིག །
en: May all the beings there be endowed with good roots.

source: དེ་ན་སེམས་ཅན་ཐམས་ཅད་གོས་ངུར་སྨྲིག་སར་པ་གྱོན་པར་གྱུར་ཅིག །
en: May all the beings there be clothed in new saffron robes.

source: དེ་ན་སེམས་ཅན་རྣམས་སྐྱེས་མ་ཐག་ཏུ་ཤིན་ཏུ་རྣམ་པར་འབྱེད་པ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཅིག །
en: May the beings there attain the samādhi of complete discernment the moment they are born.

source: ཏིང་ངེ་འཛིན་དེ་ཐོབ་པས་སངས་རྒྱས་ཀྱི་ཞིང་བགྲང་བ་ལས་འདས་པ་དག་ཏུ་མཆིས་ནས་སངས་རྒྱས་རྣམས་ལ་བསྙེན་བཀུར་བགྱིད་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་ཐམས་ཅད་མཐོང་བར་གྱུར་ཅིག །
en: May they, through attaining that samādhi, go to countless buddha realms, honor the buddhas, and, until they attain enlightenment, be able to see all the buddhas.

source: དེར་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་སྐྱེས་པར་གྱུར་པ་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པའི་རང་བཞིན་ཇི་ལྟ་བུ་དག་འཚལ་བ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པའི་རང་བཞིན་དག་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་དེ་དག་ལས་མཐོང་བར་གྱུར་ཅིག །
en: May the bodhisattvas who are born there see precious trees among the array of buddha-realm qualities, which are just as they wish the array of buddha-realm qualities to be.

source: སེམས་ཅན་རྣམས་སྐྱེས་མ་ཐག་ཏུ་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་ཞིང་། ཏིང་ངེ་འཛིན་དེ་ཐོབ་པས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་བགྲང་བ་ལས་འདས་པ་གཞན་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་རྣམས་རྟག་ཏུ་མཐོང་བར་གྱུར་ཅིག །
en: May those beings attain samādhi as soon as they are born there, and through attaining that samādhi always see the bhagavat buddhas, who reside, live, and remain, teaching the Dharma in innumerable buddha realms in the ten directions.

source: སེམས་ཅན་གང་དག་དེར་སྐྱེ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་གོས་དང་། གཞལ་མེད་ཁང་དང་། རྒྱན་དང་། སྤུད་པ་དང་། ཁ་དོག་དང་། གཟུགས་ཅི་འདྲ་བ་དེ་ལྟ་བུར་གྱུར་ཅིག །
en: May all the beings who are born there have the clothing, divine palaces, adornments, jewelry, colors, and form of the Para­nirmitavaśavartin devas.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་རྡུལ་དང་། གོར་མ་དང་། རི་ནག་པོ་རྣམས་མ་མཆིས་པ་དང་། ཁོར་ཡུག་ཀྱང་མ་མཆིས། ཁོར་ཡུག་ཆེན་པོ་ཡང་མ་མཆིས། རི་རབ་ཀྱང་མ་མཆིས། རྒྱ་མཚོ་ཆེན་པོ་ཡང་མ་མཆིས་པར་གྱུར་ཅིག །དེ་ན་སྒྲིབ་པ་དང་། ཆོད་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་དག་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མ་མཆིས་པ་དང་། དེ་ན་སེམས་ཅན་དམྱལ་བ་དང་།
en: In that buddha realm may there be no dust, no stones, and no Kāla mountains, Cakravāḍa mountains, Mahācakravāḍa mountains, Sumeru, or great oceans.

source: དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྒྲ་དག་ཀྱང་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མ་མཆིས་པ་དང་། མི་ཁོམ་པའི་སྒྲ་དང་། སྡུག་བསྔལ་བའི་སྒྲ་དང་། སྡུག་བསྔལ་ཡང་མ་ལགས་བདེ་བ་ཡང་མ་ལགས་པའི་སྒྲ་དག་ཀྱང་མ་མཆིས་པར་གྱུར་ཅིག །
en: May there be the complete absence of the wordsobscuration, obstacle, and kleśa; the complete absence of the words hells, animals, and realm of Yama; and the complete absence of the words unfavorable birth and the word suffering, and may there not be the words neither suffering nor happiness. “ ‘

source: བཅོམ་ལྡན་འདས་བདག་ནི་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་དོན་དུ་གཉེར་བ་ལགས་ཏེ།
en: Bhagavat, that is the kind of buddha realm that is my goal.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ནི་ཇི་སྲིད་དུ་དེ་ལྟ་བུའི་ཡོན་ཏན་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་མ་བགྱིས་པ་དེ་སྲིད་དུ་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཅིང་། དཀའ་བ་སྤྱོད་པར་བགྱིད་ལགས་སོ།
en: Bhadanta Bhagavat, I will remain a bodhisattva undergoing hardships until I can create a pure buddha realm that has those kinds of qualities.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་སྐྱེས་བུའི་རྩལ་དེ་ལྟ་བུ་བགྱིས་ནས། དེའི་འོག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་སྟེ།
en: Bhadanta Bhagavat, during that time I will make that kind of human effort and afterward I will attain the complete enlightenment of perfect buddhahood.

source: བདག་གིས་བྱང་ཆུབ་ཀྱི་ཤིང་ནི་དཔག་ཚད་ཁྲི་མཆིས་པར་གྱུར་ལ། བདག་དེར་མཆིས་ནས་སེམས་བསྐྱེད་པའི་སྐད་ཅིག་གཅིག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: May I have a Bodhi tree that is ten thousand yojanas high, and when I sit there, may I, through a single instant of aspiration, attain the complete enlightenment of perfect buddhahood.

source: བདག་གི་འོད་ནི་ཚད་མ་མཆིས་ཤིང་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་དག་སྣང་བར་བགྱིད་པར་གྱུར་ཅིག །
en: May my aura be without limit, illuminating hundreds of thousands of millions of trillions of buddha realms.

source: བདག་གི་ཚེའི་ཚད་ནི་དཔག་ཏུ་མ་མཆིས་ཏེ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་ཚད་མ་མཆིས་པར་གྱུར་ལ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མ་གཏོགས་པ་དེ་སུས་ཀྱང་བགྲང་བར་རྔོ་མི་ཐོགས་པར་གྱུར་ཅིག །
en: May the length of my life be beyond measure, a hundred thousand million trillion eons long, so that, except for one with omniscient wisdom, no one will be able to measure it.

source: བདག་གི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་སྤངས་ཤིང་དཔག་ཏུ་མ་མཆིས་ལ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མ་གཏོགས་པར་དེ་སུས་ཀྱང་བགྲང་བར་རྔོ་མི་ཐོགས་པར་གྱུར་ཅིག །
en: May my bodhisattva saṅgha be so immeasurable that only someone with omniscient wisdom would be able to measure it, and may it be devoid of śrāvakas and pratyekabuddhas.

source: བདག་གིས་བྱང་ཆུབ་ཐོབ་པ་ན་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མ་མཆིས་གྲངས་མ་མཆིས་པ་གཞན་དག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བདག་གི་བསྔགས་པ་གསུང་བར་འགྱུར་བ་དང་། དབྱངས་རྗེས་སུ་སྒྲོགས་པར་འགྱུར་བ་དང་། སྙན་པ་རྗོད་པར་གྱུར་ཅིག །
en: When I attain enlightenment may bhagavat buddhas in other limitless, uncountable buddha realms speak, recite, listen to, and repeat my praises.

source: བདག་གིས་བྱང་ཆུབ་ཐོབ་པ་ན་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མ་མཆིས་གྲངས་མ་མཆིས་པ་གཞན་དག་ན་མཚམས་མ་མཆིས་པ་བགྱིད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་རྣམས་མ་གཏོགས་པའི་སེམས་ཅན་གང་དག་གིས་བདག་གི་མིང་ཐོས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་དགེ་བའི་རྩ་བ་སངས་རྒྱས་ཀྱི་ཞིང་དུ་ཡོངས་སུ་བསྔོ་བ་བགྱིས་ནས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་གྱུར་ཅིག །
en: When I attain enlightenment, except for those who have perpetrated the actions with immediate results at death or who reject the true Dharma, if beings in other limitless, uncountable buddha realms, on hearing my name, dedicate their good roots to buddha realms, may they be reborn in my buddha realm.

source: བདག་གིས་བྱང་ཆུབ་ཐོབ་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་བགྲང་བ་ལས་འདས་པ་གཞན་དག་གི་བྱང་ཆུབ་སེམས་དཔའ་དག །བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འཚལ་ཞིང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་འགྱུར་ལ་དགེ་བའི་རྩ་བ་ཡང་དེར་ཡོངས་སུ་སྔོ་བར་གྱུར་ཅིག །
en: When I have attained enlightenment, may beings in countless other worlds develop the motivation for enlightenment and, with the wish to be reborn in my realm, create good roots in those realms.

source: དེ་དག་འགུམ་པའི་དུས་ཀྱི་ཚེ་ན་ཡང་བདག་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་མཆིས་ལ་དེ་དག་གིས་ཀྱང་བདག་མཐོང་ནས་བདག་ལ་དགའ་བ་དང་། དང་བ་སྐྱེ་བར་འགྱུར་ཞིང་དེ་དག་གི་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་ཀྱང་ལྡོག་པར་གྱུར་ཅིག །
en: Then at the time when they are dying, may I appear before them encircled by an assembly of bodhisattvas, and when they see me, may they feel joy and delight toward me, and may their karmic obscurations be eliminated.

source: འགུམ་པའི་དུས་བགྱིས་ནས་ཀྱང་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འགྱུར་ཞིང་དེར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སྔོན་མ་ཐོས་པའི་ཆོས་བསྟན་པ་དག་བདག་ལས་ཉན་འཚལ་བར་འགྱུར་བ་དང་།
en: Then, when they have died, may they be born in my buddha realm. May the bodhisattvas there wish to hear Dharma teachings that they have never heard before directly from me, and may they hear exactly what they wish to hear.

source: དེ་དག་ཇི་ལྟ་བུ་འཚལ་བར་འགྱུར་བ་དེ་ལྟ་བུ་ཐོས་པར་གྱུར་ཅིག །བདག་གིས་བྱང་ཆུབ་འཐོབ་པ་ན་སངས་རྒྱས་ཀྱི་ཞིང་བགྲང་བ་ལས་འདས་པ་སྙེད་དག་གི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་གིས་བདག་གི་མིང་ཐོས་པར་གྱུར་པ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་ཅིང་བཟོད་པ་དང་པོ་དང་། དེ་བཞིན་དུ་གཉིས་པ་ཡང་ཐོབ་པར་འགྱུར་ཞིང་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཇི་ལྟ་བུ་འཚལ་བ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱང་ཐོབ་པར་གྱུར་ཅིག །
en: When I attain enlightenment, may the bodhisattva mahāsattvas of innumerable buddha realms who hear my name attain irreversible progress toward the highest, most complete enlightenment; may they attain the first patience and likewise the second; and may they attain the samādhis and dhāraṇīs that they wish to attain. “ ‘

source: བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་བསྐལ་པ་བགྲང་བ་ལས་འདས་པ་སྙེད་དག་ན་སངས་རྒྱས་ཀྱི་ཞིང་བགྲང་བ་ལས་འདས་པ་སྙེད་དག་གི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདག་གི་མིང་ཐོས་ནས་ཤིན་ཏུ་དགའ་བ་དང་། རབ་ཏུ་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་ཐོབ་པར་འགྱུར་བ་དང་། ངོ་མཚར་ཐོབ་པར་གྱུར་ནས་བདག་ཉིད་ལ་ཕྱག་འཚལ་ཞིང་སྙན་པ་དང་གྲགས་པ་རྗོད་པར་གྱུར་ཅིག །
en: Even after I have passed into parinirvāṇa, for countless eons may bodhisattvas in countless buddha realms on hearing my name attain great joy, perfect joy, and supreme joy, and may they be amazed, pay homage to me, and glorify and praise me.

source: གང་གི་ཚེ་བདག་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་ཡང་སངས་རྒྱས་ཀྱི་མཛད་པ་དག་མངོན་པར་བསྒྲུབས་ནས་དེའི་འོག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: When I become a bodhisattva may I accomplish the deeds of a buddha, and afterward may I attain the complete enlightenment of perfect buddhahood.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་བདག་ལ་མཆོག་ཏུ་དད་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བཟོད་པ་དང་པོ་དང་། གཉིས་པ་དང་། གསུམ་པ་ཐོབ་པར་འགྱུར་ཞིང་ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། བཟོད་པ་ཇི་ལྟ་བུ་འཚལ་བ་དེ་ལྟ་བུ་ཐོབ་པར་གྱུར་ནས།
en: When I have attained complete enlightenment, may the bodhisattvas who have complete faith in me attain the first patience, the second, and the third; attain the samādhi, dhāraṇī, and patience that they wish to; and tend to them until enlightenment. “ ‘

source: བྱང་ཆུབ་ཀྱི་མཐའི་བར་དུ་རྗེས་སུ་མཐོང་བར་གྱུར་ཅིག །བདག་བྱང་ཆུབ་ཐོབ་པ་ན་སངས་རྒྱས་ཀྱི་ཞིང་བགྲང་བ་ལས་འདས་པ་དག་གི་བུད་མེད་གང་དག་གིས་བདག་གི་མིང་ཐོས་པར་གྱུར་པ་དེ་དག་ཤིན་ཏུ་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དང་། དང་བ་ཐོབ་པར་འགྱུར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ནས་སླན་ཆད་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་བུད་མེད་ཉིད་མི་འཐོབ་པར་གྱུར་ཅིག །
en: When I attain enlightenment, may women in countless buddha realms who hear my name have great joy, perfect joy, and supreme joy, have delight, and develop the aspiration for the highest, most complete enlightenment, and from then until enlightenment may they never again become a woman.

source: བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་བསྐལ་པ་བགྲང་བ་ལས་འདས་པ་སྙེད་དག་གི་བུད་མེད་བགྲང་བ་ལས་འདས་པ་སྙེད་དག་གིས་བདག་གི་མིང་ཐོས་པར་གྱུར་པ་དེ་དག་ཤིན་ཏུ་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དང་། དང་བ་ཐོབ་པར་འགྱུར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ནས་སླན་ཆད་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་བུད་མེད་ཉིད་མི་འཐོབ་པར་གྱུར་ཅིག །
en: Even after I have passed into parinirvāṇa, may countless women throughout countless eons who hear my name have great joy, perfect joy, and supreme joy, have delight, and develop the aspiration for the highest, most complete enlightenment, and from then until enlightenment never again become a woman. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ནི་དེ་འདྲ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དང་། དེ་འདྲ་བའི་སེམས་ཅན་བསམ་པ་ཡོངས་སུ་དག་པ་དག་འཚལ་ཏེ།
en: Bhadanta Bhagavat, I wish for that kind of buddha realm and those kinds of beings with pure thoughts.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ནི་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱིའོ།
en: Bhadanta Bhagavat, may I attain the complete enlightenment of perfect buddhahood in such a buddha realm.’ “
